# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\yomat\Documents\PSoC Creator\AFE_DevItem1\AFE DevItem1.cydsn\AFE DevItem1.cyprj
# Date: Tue, 03 Aug 2021 11:25:21 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyClk_LF} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {I2C_1_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 3 7} [list [get_pins {ClockBlock/ff_div_1}]]
create_generated_clock -name {I2C_2_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 3 7} [list [get_pins {ClockBlock/ff_div_2}]]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list [get_pins {ClockBlock/ff_div_5}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/periclk}] -edges {1 3 7} [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {CyPeriClk_App} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\yomat\Documents\PSoC Creator\AFE_DevItem1\AFE DevItem1.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\yomat\Documents\PSoC Creator\AFE_DevItem1\AFE DevItem1.cydsn\AFE DevItem1.cyprj
# Date: Tue, 03 Aug 2021 11:25:04 GMT
